#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсходнаяСтрока = "Обычный текст, <b>жирный</b> и <i>курсив</i>.
                      |А теперь <span style=""background-color: yellow; color: red"">красный текст на желтом фоне</span>.
                      |<a href=""http://ya.ru"" style=""font-weight:bold;"">Цветная и жирная ссылочка</a>.
                      |Картинка <img src=""Календарь"">.
                      |Шрифт можно поменять <span style=""font-family: consolas"">consolas</span> и размер<span style=""font-size: 18; color: #f0f"">18</span>.
                      |<span style=""text-decoration: line-through"">Еще можно так</span> и <span style=""text-decoration: underline"">так</span>";
	
	ФорматироватьСтроку();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Форматировать(Команда)
	
	ФорматироватьСтроку();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ФорматироватьСтроку()
	
	Элементы.Результат.Заголовок = РеквизитФормыВЗначение("Объект").ФорматированнаяСтрока(ИсходнаяСтрока);
	
КонецФункции

#КонецОбласти